Revit 2027 API
ViewDetailLevel Enumeration
 Detail level of the view
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ViewDetailLevel
Public Enumeration ViewDetailLevel
public enum class ViewDetailLevel
type ViewDetailLevel
Members
Member name | Value | Description
Coarse | 1 |  Coarse
Fine | 3 |  Fine
Medium | 2 |  Medium
Undefined | 0 |  View does not use Detail Level
See Also
Reference
Autodesk.Revit.DB Namespace